Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.141/PIC32CM-LS60/svd/PIC32CM2532LS60064.svd
            <register>
               <name>WRBADDR</name>
               <description>Write-Back Memory Section Base Address</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>WRBADDR</name>
                     <description>Write-Back Memory Base Address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHID</name>
               <description>Channel ID</description>
               <addressOffset>0x3F</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHCTRLA</name>
               <description>Channel Control A</description>
               <addressOffset>0x40</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Channel Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Channel Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Channel run in standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHCTRLB</name>
               <description>Channel Control B</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EVACT</name>
                     <description>Event Input Action</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EVACTSelect</name>
                        <enumeratedValue>
                           <name>NOACT</name>
                           <description>No action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIG</name>
                           <description>Transfer and periodic transfer trigger</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CTRIG</name>
                           <description>Conditional transfer trigger</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CBLOCK</name>
                           <description>Conditional block transfer</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUSPEND</name>
                           <description>Channel suspend operation</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESUME</name>
                           <description>Channel resume operation</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SSKIP</name>
                           <description>Skip next block suspend action</description>
                           <value>0x6</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EVIE</name>
                     <description>Channel Event Input Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EVOE</name>
                     <description>Channel Event Output Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVL</name>
                     <description>Channel Arbitration Level</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>LVLSelect</name>
                        <enumeratedValue>
                           <name>LVL0</name>
                           <description>Channel Priority Level 0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LVL1</name>
                           <description>Channel Priority Level 1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LVL2</name>
                           <description>Channel Priority Level 2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LVL3</name>
                           <description>Channel Priority Level 3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIGSRC</name>
                     <description>Trigger Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>TRIGSRCSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Only software/event triggers</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RTC_TIMESTAMP</name>
                           <description>RTC Timestamp Trigger</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSU_DCC0</name>
                           <description>ID for DCC0 register</description>
                           <value>0x02</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSU_DCC1</name>
                           <description>ID for DCC1 register</description>
                           <value>0x03</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM0_RX</name>
                           <description>SERCOM0 RX Trigger</description>
                           <value>0x04</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM0_TX</name>
                           <description>SERCOM0 TX Trigger</description>
                           <value>0x05</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM1_RX</name>
                           <description>SERCOM1 RX Trigger</description>
                           <value>0x06</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM1_TX</name>
                           <description>SERCOM1 TX Trigger</description>
                           <value>0x07</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM2_RX</name>
                           <description>SERCOM2 RX Trigger</description>
                           <value>0x08</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM2_TX</name>
                           <description>SERCOM2 TX Trigger</description>
                           <value>0x09</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM3_RX</name>
                           <description>SERCOM3 RX Trigger</description>
                           <value>0x0A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM3_TX</name>
                           <description>SERCOM3 TX Trigger</description>
                           <value>0x0B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM4_RX</name>
                           <description>SERCOM4 RX Trigger</description>
                           <value>0x0C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM4_TX</name>
                           <description>SERCOM4 TX Trigger</description>
                           <value>0x0D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM5_RX</name>
                           <description>SERCOM5 RX Trigger</description>
                           <value>0x0E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SERCOM5_TX</name>
                           <description>SERCOM5 TX Trigger</description>
                           <value>0x0F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0_OVF</name>
                           <description>TC0 Overflow Trigger</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0_MC0</name>
                           <description>TC0 Match/Compare 0 Trigger</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC0_MC1</name>
                           <description>TC0 Match/Compare 1 Trigger</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1_OVF</name>
                           <description>TC1 Overflow Trigger</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1_MC0</name>
                           <description>TC1 Match/Compare 0 Trigger</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC1_MC1</name>
                           <description>TC1 Match/Compare 1 Trigger</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2_OVF</name>
                           <description>TC2 Overflow Trigger</description>
                           <value>0x16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2_MC0</name>
                           <description>TC2 Match/Compare 0 Trigger</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TC2_MC1</name>
                           <description>TC2 Match/Compare 1 Trigger</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0_OVF</name>
                           <description>TCC0 Overflow Trigger</description>
                           <value>0x19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0_MC0</name>
                           <description>TCC0 Match/Compare 0 Trigger</description>
                           <value>0x1A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0_MC1</name>
                           <description>TCC0 Match/Compare 1 Trigger</description>
                           <value>0x1B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0_MC2</name>
                           <description>TCC0 Match/Compare 2 Trigger</description>
                           <value>0x1C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC0_MC3</name>
                           <description>TCC0 Match/Compare 3 Trigger</description>
                           <value>0x1D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1_OVF</name>
                           <description>TCC1 Overflow Trigger</description>
                           <value>0x1E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1_MC0</name>
                           <description>TCC1 Match/Compare 0 Trigger</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC1_MC1</name>
                           <description>TCC1 Match/Compare 1 Trigger</description>
                           <value>0x20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2_OVF</name>
                           <description>TCC2 Overflow Trigger</description>
                           <value>0x21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2_MC0</name>
                           <description>TCC2 Match/Compare 0 Trigger</description>
                           <value>0x22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC2_MC1</name>
                           <description>TCC2 Match/Compare 1 Trigger</description>
                           <value>0x23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC3_OVF</name>
                           <description>TCC3 Overflow Trigger</description>
                           <value>0x24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC3_MC0</name>
                           <description>TCC3 Match/Compare 0 Trigger</description>
                           <value>0x25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC3_MC1</name>
                           <description>TCC3 Match/Compare 1 Trigger</description>
                           <value>0x26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC3_MC2</name>
                           <description>TCC3 Match/Compare 2 Trigger</description>
                           <value>0x27</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TCC3_MC3</name>
                           <description>TCC3 Match/Compare 3 Trigger</description>
                           <value>0x28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ADC_RESRDY</name>
                           <description>ADC Result Ready Trigger</description>
                           <value>0x29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC_EMPTY0</name>
                           <description>DAC Empty 0 Trigger</description>
                           <value>0x2A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC_EMPTY1</name>
                           <description>DAC Empty 1 Trigger</description>
                           <value>0x2B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTC_EOC</name>
                           <description>PTC End of Conversion Trigger</description>
                           <value>0x2C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTC_SEQ</name>
                           <description>PTC Sequence Trigger</description>
                           <value>0x2D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTC_WCOMP</name>
                           <description>PTC Window Compare Trigger</description>
                           <value>0x2E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2S_RX0</name>
                           <description>I2S RX0 Trigger</description>
                           <value>0x2F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2S_RX1</name>
                           <description>I2S RX1 Trigger</description>
                           <value>0x30</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2S_TX0</name>
                           <description>I2S TX0 Trigger</description>
                           <value>0x31</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>I2S_TX1</name>
                           <description>I2S TX1 Trigger</description>
                           <value>0x32</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRIGACT</name>
                     <description>Trigger Action</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TRIGACTSelect</name>
                        <enumeratedValue>
                           <name>BLOCK</name>
                           <description>One trigger required for each block transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BEAT</name>
                           <description>One trigger required for each beat transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRANSACTION</name>
                           <description>One trigger required for each transaction</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CMD</name>
                     <description>Software Command</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CMDSelect</name>
                        <enumeratedValue>
                           <name>NOACT</name>
                           <description>No action</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUSPEND</name>
                           <description>Channel suspend operation</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESUME</name>
                           <description>Channel resume operation</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CHINTENCLR</name>
               <description>Channel Interrupt Enable Clear</description>
               <addressOffset>0x4C</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>TERR</name>
                     <description>Channel Transfer Error Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Channel Transfer Complete Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Channel Suspend Interrupt Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
